Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерепоставленноеДарится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопоставкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачаНеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьСейчас</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/Ext/ManagerModule.bsl
Функция ПолучитьПарноеЗначениеПеречисленияУТ10(Действие) Экспорт
	
	//+Макрушин Е. 11.02.2026 #UT10-5665
	//при перегрузке актов о расхождении обратно из УТ10 в УТ10 значение перечисления ВариантыДействийПоРасхождениямВАктеПослеОтгрузки 
	//приводится к ВариантыДействийПоРасхождениямВАктеПослеПриемки, т.к. на стороне УТ10 только ВариантыДействийПоРасхождениямВАктеПослеПриемки
	
	Результат = "";
		
	//недостача	
	Если Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется Тогда
		Результат = "ОформитьНедостачу";
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана Тогда
		Результат = "НедостачаНеПризнана";
	//излишек	
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного Тогда
		Результат = "ОформитьПерепоставленное";
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится Тогда
		Результат = "ПерепоставленноеДарится";
	КонецЕсли;
		
	Возврат Результат;
	//-Макрушин Е. 11.02.2026 #UT10-5665
	
КонецФункции
